In [17]:
!pip install pandasql

Requirement already satisfied: pandasql in c:\users\rt01306\appdata\local\programs\python\python310\lib\site-packages (0.7.3)
Requirement already satisfied: numpy in c:\users\rt01306\appdata\local\programs\python\python310\lib\site-packages (from pandasql) (1.23.1)
Requirement already satisfied: pandas in c:\users\rt01306\appdata\local\programs\python\python310\lib\site-packages (from pandasql) (1.5.3)
Requirement already satisfied: sqlalchemy in c:\users\rt01306\appdata\local\programs\python\python310\lib\site-packages (from pandasql) (1.4.46)
Requirement already satisfied: pytz>=2020.1 in c:\users\rt01306\appdata\local\programs\python\python310\lib\site-packages (from pandas->pandasql) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\rt01306\appdata\local\programs\python\python310\lib\site-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\rt01306\appdata\local\programs\python\python310\lib\site-packages (from sqlalchemy->pandasql) (3.0.1)
Requirement already satisfied: six>=1.5 in c:\users\rt01306\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.1->pandas->pandasql) (1.16.0)

WARNING: You are using pip version 22.0.4; however, version 23.3.1 is available.
You should consider upgrading via the 'C:\Users\rt01306\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

In [18]:
!pip install SQLAlchemy==1.4.46

Requirement already satisfied: SQLAlchemy==1.4.46 in c:\users\rt01306\appdata\local\programs\python\python310\lib\site-packages (1.4.46)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\rt01306\appdata\local\programs\python\python310\lib\site-packages (from SQLAlchemy==1.4.46) (3.0.1)

WARNING: You are using pip version 22.0.4; however, version 23.3.1 is available.
You should consider upgrading via the 'C:\Users\rt01306\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

In [1]:
import pandas as pd
from pandasql import sqldf



## *Lectura del fichero con Pandas*

In [2]:
# Read the dataframes
winter = pd.read_csv("datasets/winter.csv")
dictionary = pd.read_csv("datasets/dictionary.csv")

In [3]:
# Define the function used for the queries
pysqldf = lambda q: sqldf(q, globals())



# 04 - Data Manipulation Lenguaje

Permite a los usuarios manipular los datos.

## SELECT
La sentencia SELECT se utiliza para extraer datos de la base de datos.

```SQL
SELECT column_name1, column_name2, ... FROM table_name
```

Si en vez de nombres de columnas se emplea * se obtienen todas las columnas.

```SLQ
SELECT * FROM table_name
```

La cláusula DISTINCT solamente muestra las combinaciones diferentes para las columnas seleccionadas.

```SQL
SELECT DISTINCT column_name1, column_name2, ... FROM table_name
```

La cláusula LIMIT limita el número de filas mostradas a la cantidad que queramos

```SQL
SELECT column_name1, column_name2, ... FROM table_name LIMIT 20
```

In [4]:
query = "SELECT * FROM winter"

pysqldf(query)

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1924,Chamonix,Biathlon,Biathlon,"BERTHET, G.",FRA,Men,Military Patrol,Bronze
1,1924,Chamonix,Biathlon,Biathlon,"MANDRILLON, C.",FRA,Men,Military Patrol,Bronze
2,1924,Chamonix,Biathlon,Biathlon,"MANDRILLON, Maurice",FRA,Men,Military Patrol,Bronze
3,1924,Chamonix,Biathlon,Biathlon,"VANDELLE, André",FRA,Men,Military Patrol,Bronze
4,1924,Chamonix,Biathlon,Biathlon,"AUFDENBLATTEN, Adolf",SUI,Men,Military Patrol,Gold
...,...,...,...,...,...,...,...,...,...
5765,2014,Sochi,Skiing,Snowboard,"JONES, Jenny",GBR,Women,Slopestyle,Bronze
5766,2014,Sochi,Skiing,Snowboard,"ANDERSON, Jamie",USA,Women,Slopestyle,Gold
5767,2014,Sochi,Skiing,Snowboard,"MALTAIS, Dominique",CAN,Women,Snowboard Cross,Silver
5768,2014,Sochi,Skiing,Snowboard,"SAMKOVA, Eva",CZE,Women,Snowboard Cross,Gold
5769,2014,Sochi,Skiing,Snowboard,"TRESPEUCH, Chloe",FRA,Women,Snowboard Cross,Bronze

In [5]:
query = '''SELECT Country, Athlete, Medal 
           FROM winter'''

pysqldf(query)

     Country               Athlete   Medal
0        FRA           BERTHET, G.  Bronze
1        FRA        MANDRILLON, C.  Bronze
2        FRA   MANDRILLON, Maurice  Bronze
3        FRA       VANDELLE, André  Bronze
4        SUI  AUFDENBLATTEN, Adolf    Gold
...      ...                   ...     ...
5765     GBR          JONES, Jenny  Bronze
5766     USA       ANDERSON, Jamie    Gold
5767     CAN    MALTAIS, Dominique  Silver
5768     CZE          SAMKOVA, Eva    Gold
5769     FRA      TRESPEUCH, Chloe  Bronze

[5770 rows x 3 columns]

In [6]:
query = '''SELECT DISTINCT Medal 
           FROM winter'''

pysqldf(query)

    Medal
0  Bronze
1    Gold
2  Silver

In [7]:
query = '''SELECT DISTINCT Medal, Gender
           FROM winter'''

pysqldf(query)

    Medal Gender
0  Bronze    Men
1    Gold    Men
2  Silver    Men
3  Bronze  Women
4    Gold  Women
5  Silver  Women

In [8]:
query = '''SELECT *
           FROM winter
           LIMIT 5'''

pysqldf(query)

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1924,Chamonix,Biathlon,Biathlon,"BERTHET, G.",FRA,Men,Military Patrol,Bronze
1,1924,Chamonix,Biathlon,Biathlon,"MANDRILLON, C.",FRA,Men,Military Patrol,Bronze
2,1924,Chamonix,Biathlon,Biathlon,"MANDRILLON, Maurice",FRA,Men,Military Patrol,Bronze
3,1924,Chamonix,Biathlon,Biathlon,"VANDELLE, André",FRA,Men,Military Patrol,Bronze
4,1924,Chamonix,Biathlon,Biathlon,"AUFDENBLATTEN, Adolf",SUI,Men,Military Patrol,Gold



**Ejercicios: Tabla winter** - diapositiva 26



*1. Mostrar el nombre del atleta y la ciudad para todos los atletas*

In [9]:
query = '''select city, sport from winter'''

pysqldf(query)

          City     Sport
0     Chamonix  Biathlon
1     Chamonix  Biathlon
2     Chamonix  Biathlon
3     Chamonix  Biathlon
4     Chamonix  Biathlon
...        ...       ...
5765     Sochi    Skiing
5766     Sochi    Skiing
5767     Sochi    Skiing
5768     Sochi    Skiing
5769     Sochi    Skiing

[5770 rows x 2 columns]



*2. Mostrar toda la información de la tabla*

In [ ]:
query = ''''''

pysqldf(query)



*3. Mostrar el año, el deporte y el país*

In [ ]:
query = ''''''

pysqldf(query)



*4. Mostrar todos los países sin duplicar*

In [ ]:
query = ''''''

pysqldf(query)



## AS

La instrucción AS se utilizan para dar una tabla o una columna en una tabla, un nombre temporal. 

La instrucción se utilizan a menudo para hacer más legibles los nombres de columna. 

```SQL 
SELECT column_name AS alias_name FROM table_name

SELECT column_name(s) FROM table_name AS alias_name
```

In [ ]:
query = ''''''

pysqldf(query)



**Ejercicios: Tabla winter** - dipositiva 29



*1. Mostrar la columna Athlete como “Participante” y Country como “Origen”.*

In [ ]:
query = ''''''

pysqldf(query)



*2. Mostrar todas los ciudades sin duplicar como “CiudadSinDuplicar”*

In [ ]:
query = ''''''

pysqldf(query)



*3. Mostrar la columna ciudad como “Sede” y el año como “Fecha”*

In [ ]:
query = ''''''

pysqldf(query)

*4. Mostrar toda la información de la tabla 'dictionary'*

In [ ]:
query = ''''''

pysqldf(query)

*5. Muestra las columnas Country como Pais y Code como Codigo*

In [ ]:
query = ''''''

pysqldf(query)